lnf/app/controllers/articles_controller.rb

   def create
      @article = Article.new(params.require(:article).permit(:title, :text))

      @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-03-05 14:07:55.575337"], ["text", "r"], ["title", "r"], ["updated_at", "2016-03-05 14:07:55.575337"]]