lnf/app/controllers/founds_controller.rb

   def index
      @founds = Found.all
---
SELECT "founds".* FROM "founds"

   def show
      @found = Found.find(params[:id])
---
SELECT  "founds".* FROM "founds"  WHERE "founds"."id" = ? LIMIT 1  [["id", 2]]

   def create
      @found = Found.new(params.require(:found).permit(:catagory, :location, :email))

      if params[:found][:email].include? "@usna.edu"
         @found.save
---
INSERT INTO "founds" ("catagory", "created_at", "email", "location", "updated_at") VALUES (?, ?, ?, ?, ?)  [["catagory", "phone"], ["created_at", "2016-03-05 15:40:19.293388"], ["email", "m180378@usna.edu"], ["location", "bancroft hall"], ["updated_at", "2016-03-05 15:40:19.293388"]]