lnf/app/controllers/losts_controller.rb

SELECT "losts".* FROM "losts"
---
   def index
      @losts = Lost.all

SELECT  "losts".* FROM "losts"  WHERE "losts"."id" = ? LIMIT 1  [["id", 1]]
---
   def show
      @lost = Lost.find(params[:id])

INSERT INTO "losts" ("catagory", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["catagory", "wallet"], ["created_at", "2016-03-05 15:44:20.476727"], ["email", "needmoneyback@usna.edu"], ["updated_at", "2016-03-05 15:44:20.476727"]]
---
   def create
      @lost = Lost.new(params.require(:lost).permit(:catagory, :location, :description, :email))
      @founds = Found.where("catagory = ? AND location = ?", params[:lost][:catagory], params[:lost][:location])


      if params[:lost][:email].include? "@usna.edu"
         @lost.save